[
    {
      "Name": "The Amazing Spider-Man (2018) #19.1",
      "Description": "“HUNTED” TIE-IN! With Kraven gathering up all the animal-themed villains for the grandest hunt of all, Lizard has a target on his back! But the Lizard has a plan of his own-- and it involves something truly terrifying!",
      "WriterName": "Nick Spencer",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/f/40/5cacf84edd134/clean.jpg"
    },
    {
      "Name": "War of the Realms: War Scrolls (2019) #1",
      "Description": "THE MUST-READ COMPANION TO WAR OF THE REALMS! Gifted the sight of the Bifrost, Daredevil watches all Midgard burn under Malekith’s invasion. How will the Guardian of Hell’s Kitchen - guard an entire Earth turned to Hell? Find out in a story by Jason Aaron & Andrea Sorrentino! All this and more (including a new Howard the Duck story by Chip Zdarsky & Joe Quinones!), straight from the battlefield of WAR OF THE REALMS! ",
      "WriterName": "Ram V, Chip Zdarsky, Jason Aaron",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/9/30/5cacf748f1213/clean.jpg"
    },
    {
      "Name": "True Believers: Avengers - The Gatherers Saga (2019) #1",
      "Description": "Reprinting Avengers (1963) #343",
      "WriterName": "Bob Harras",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/2/70/5cacf5d2ded57/clean.jpg"
    },
    {
      "Name": "War of the Realms: Punisher (2019) #1",
      "Description": "PUNISHER: AVENGER OF MIDGARD! The War of The Realms has brought monsters to the streets of New York City, but New York has a monster all its own - Frank Castle, A.K.A. THE PUNISHER! And he’ll be damned to Hel if he’s going to let a bunch of Ten Realms tin-pot tyrants terrorize his town. But given he’s one man against an army of monsters, Hel might soon have him! The War of Realms is about to meet Marvel’s One Man Army. Expect Punishment! ",
      "WriterName": "Gerry Duggan",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/5/b0/5cacf78db4ffc/clean.jpg"
    },
    {
      "Name": "Marvel's Spider-Man: City at War (2019) #2",
      "Description": "CONTINUING THE SAGA OF SPIDER-MAN FROM THE BRAND-NEW UNIVERSE! The worlds of PETER PARKER and SPIDER-MAN continue to collide – with his beloved AUNT MAY and current crusading Daily Bugle reporter (and former girlfriend) MARY JANE – caught in the middle! Teenager MILES MORALES has two heroes – Spider-Man and his police office father, JEFFERSON DAVIS – but how will their chance meeting lead to both triumph and tragedy? Plus: Who are the INNER DEMONS, and how is their crime spree connected to the fall of the KINGPIN - and the rise of an even darker foe? ",
      "WriterName": "Michele Bandini",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/9/60/5cacf554b7219/clean.jpg"
    },
    {
      "Name": "Magnificent Ms. Marvel (2019) #2",
      "Description": "Ms. Marvel is reeling from a devastating loss, but with an alien invasion ravaging Jersey City, she’s not going to have much time to grieve! Even if Kamala saves her hometown, will her family ever be the same? And what’s all this business about a “Chosen One”? ",
      "WriterName": "Saladin Ahmed",
      "Published": "2019-04-17",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/b/c0/5cacf580ba144/clean.jpg"
    },
    {
      "Name": "Amazing Spider-Man Facsimile Edition (2019) #252",
      "Description": "The stunning debut of Spider-Man’s black suit — the alien costume that would one day become Venom! As Spidey makes his homecoming from the super hero Secret Wars, he returns with a miraculous new outfit, a striking black-and-white Spider-Man costume that morphs and responds to his very thoughts — allowing him to change back to Peter Parker at will! But is it possible that this miraculous article of alien clothing may have a mind of its own? With New Yorkers made uneasy by his new look and the Secret Wars photos he took far too alien to sell to the Daily Bugle, can Peter pick up the life he left behind? Relive the issue that set in motion the entire saga of Venom! It’s one of the all-time great Marvel comic books, boldly re-presented in its original form, ads and all!",
      "WriterName": "Roger Stern, Tom Defalco",
      "Published": "2019-04-16",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/c/90/5cacf6666f15b/clean.jpg"
    },
    {
      "Name": "Spider-Man: Life Story (2019) #2",
      "Description": "CAN PETER AND GWEN FIND HAPPINESS IN THE 1970s? The GREEN GOBLIN is out of their lives, but NORMAN OSBORN isn’t! Can PETER AND GWEN find happiness as the world of the 1970s dances on around them?",
      "WriterName": "Chip Zdarsky",
      "Published": "2019-04-16",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/1/e0/5cacf2a30ffd5/clean.jpg"
    },
    {
      "Name": "Shuri (2018) #7",
      "Description": "GUEST-STARRING MILES MORALES AND MS. MARVEL! When it looks like an enemy of Wakanda has left a signature behind in America, Princess Shuri heads overseas to investigate. But she’s not the only hero on the case. With New York City and New Jersey on the line, there’s no way Miles Morales and Kamala Khan are sitting this one out. Guest creative team Vita Ayala and Paul Davidson take Shuri on a star-studded adventure! ",
      "WriterName": "Paul Davidson",
      "Published": "2019-04-16",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/9/60/5cacf597404a5/clean.jpg"
    },
    {
      "Name": "True Believers: Avengers - Endgame! (2019) #1",
      "Description": "Reprinting Avengers (1963) #71 ",
      "WriterName": "Roy Thomas",
      "Published": "2019-04-16",
      "PhotoUrl": "https://i.annihil.us/u/prod/marvel/i/mg/c/e0/5cacf775b7a77/clean.jpg"
    }
  ]